:PROPERTIES:
:ID:       8f26da40-c5cb-4c37-9893-b1999c58366c
:END:
#+TITLE: Running CI tests like production
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

I got burned last month: my tests passed in CI but the app crashed in
production because of a file permission bug. The tests ran as root,
but production runs as a regular user. I want my CI containers to use
the same non-root user as production so I catch these issues early.

* Making sure the test container runs as a regular user

  First I need to verify that my test container actually runs as a
  non-root user, not root:

  #+NAME: alpine_user_whoami
  #+begin_src fixtureyaml
func: alpine-user
chain:
  - with-exec: [whoami]
  - stdout
  #+end_src

  #+RESULTS[84729e04121e22cfb1858e425b78310ab46feb48]: alpine_user_whoami
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-user with-exec --args="whoami" stdout
  #+end_src

  #+RESULTS[598314540270cb528c156af82b8c46b52e84879f]:
  : sam
  :end:

* The test runner needs a proper home directory

  My test harness writes temporary config files to =$HOME=. I need to
  make sure the user has a real home directory, not =/= or
  =/nonexistent=:

  #+NAME: alpine_user_home
  #+begin_src fixtureyaml
func: alpine-user
chain:
  - with-exec: [pwd]
  - stdout
  #+end_src

  #+RESULTS[42b210ef97245f0d08c57b8c79d3fccbfc73bbb7]: alpine_user_home
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-user with-exec --args="pwd" stdout
  #+end_src

  #+RESULTS[eb99389b500365541b1090dbc071bf550d4dbba6]:
  : /home/sam
  :end:

* Matching the production UID

  Our Kubernetes pods run with UID 1000. I need the CI user to have
  the same UID so that volume mounts and file ownership behave
  identically:

  #+NAME: alpine_user_id
  #+begin_src fixtureyaml
func: alpine-user
chain:
  - with-exec: ["id", sam]
  - stdout
  #+end_src

  #+RESULTS[785ecabca308136d490fbb94e1d4348ee96d0d1e]: alpine_user_id
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-user with-exec --args="id","sam" stdout
  #+end_src

  #+RESULTS[b11dd3ac761d5ca466b7f65120a379da8603ae4c]:
  : uid=1000(sam) gid=1000(sam) groups=1000(sam),1000(sam)
  :end:

* Some tests need Debian for native libraries

  A few integration tests link against =libpq=, which is easier on
  Debian. Same non-root guarantee:

  #+NAME: debian_user_id
  #+begin_src fixtureyaml
func: debian-user
chain:
  - with-exec: ["id", sam]
  - stdout
  #+end_src

  #+RESULTS[7e64e3c9664f58b69957c7ec81573005cf09144c]: debian_user_id
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call debian-user with-exec --args="id","sam" stdout
  #+end_src

  #+RESULTS[2b2983050ff2cd255654a8c58e45e97a477524a7]:
  : uid=1000(sam) gid=1000(sam) groups=1000(sam),100(users)
  :end:
